//파일명 : Test.java 

class Test 
{
	public static void main(String[] args) 
	{
		System.out.println("Hello World!");
	}
}

/*
번역방법 : javac Test.java
실행방법 : java Test
*/

https://www.eclipse.org/downloads/


D:\JAVA\workspace_20161227

JAVA : 객체지향언어 

1세대 - 기계어, 어셈블리어 

          100
  =  1*10의2승   + 0 * 10의 1승 + 0 * 10의 0승
  =  1*2의 2승    + 0 * 2의 1승    + 0 X 2의 0승 

          256  128 64 32   16    8   4   2  1
                                           1   0   1  0
										   1   1   1  0 
										   1   1   1  1
          1byte - 8bit 
		  11111111 -> 255, FF

         100000000

          1100 0101 0010 1101 0001
           C       5        2      D      1

		  16진수 1 2 3 4 5 6 7 8 9 A B C D E F 10

          어셈블리어 - 어셈블러(어셈블리어를 번역해서 
		                   기계어를 만들어준다) 

2세대 - 자연어 (사람의 말에 가깝게 만들어진 언어) 
           특수목적용 언어 <--> 다목적용 언어 
		   포트란(계산용언어, 수학과 물리학과)
		   코볼(데이타처리, 은행이나, 회사직원관리, 
		          급여관리) 
3세대 - 구조적 프로그래밍 언어 
           C, 파스칼, 알골, PL/1, Ada..............
		   1. 설계도 
		   2. 모듈화 프로그램  - 모듈은 일의 작은 단위
		   3. 순서도
		   4. 프로그램 소스안에 주석을 많이 달자 
           5. 알고리즘(자료구조)
           6. 절차중심 
4세대 - 객체지향언어 
           결과중심용 언어 

		   클래스 -- 사용자가 만드는 데이타 타입 
           (설계도) 

		   설계도 가지고 실제 객체를 만든다 
		   
			 
정부기관-관공서  Linux(표준)  - java
                       Window NT(Server 버전)
                         java, .net


     RAM (Random Access Memory) 
	 - 주기억장치 

	 CPU(Central Process Unit)

	 0111 1111 (+127)
	 1000 0001 (-127)- 127의 2의 보수  = 0
	 --------------------
    100000000

	양의정수 - 10진수를 2진수로 바꾸어 저장
	음의정수 - 부호와 2의 보수 

